app/views/projects/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "Developer"]]
---

<%= select_tag(:user_ids,options_from_collection_for_select(User.where(:role => "Developer"), :id, :name).html_safe, multiple: true ) %>