app/views/bugs/new.html.erb

<%= date_field(:bug, :deadline) %>
<%= label_tag :"Assign to" %>: <%= select_tag(:assignto,options_from_collection_for_select(
User.all, :id, :name) ) %>
---
SELECT "users".* FROM "users"