app/controllers/bugs_controller.rb

	def show
		  @id=params[:id]
          @bugs=Bug.where(:project_id => params[:id])
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."project_id" = $1  [["project_id", 8]]

   def create_bug
     @bug = Bug.new
     @bug.title=params[:title]
     @bug.description=params[:description]
     @bug.bug_type=params[:type]


     @bug.assignedto_id = params[:assignto]
     @bug.project_id = params[:project_id]
      id=session[:user][0]['id']
     @bug.createdby_id = id
---
INSERT INTO "bugs" ("project_id", "title", "description", "bug_type", "deadline", "screenshot", "createdby_id", "assignedto_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

   def details
   	   @bugs=Bug.find(params[:id])
---
SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]