app/controllers/dashboard_controller.rb

  def home
     @user=session[:user][0]
     @role=@user['role']
     if(@role == 'Manager')
          @projects= User.find(@user['id']).owned_projects
      else
      	@projects=User.find(@user['id']).projects
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = $1  [["user_id", 6]]

      def project_details
      	   @project=Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]