app/controllers/projects_controller.rb

INSERT INTO "projects" ("manager_id", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["manager_id", 2], ["name", "bug_Zilla"], ["description", "test project"], ["created_at", "2018-03-14 10:21:49.595107"], ["updated_at", "2018-03-14 10:21:49.595107"]]
INSERT INTO "project_users" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 3], ["user_id", 4], ["created_at", "2018-03-14 10:23:12.295799"], ["updated_at", "2018-03-14 10:23:12.295799"]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 2]]
---
  def create
    puts("hello world")
    @p=params


    @pr=Project.new
    @pr.name=params[:name]
    @pr.description=params[:description]
    @pr.manager_id=session[:user][0]['id']
    if @pr.save

       params[:user_ids].each do |i|



               p_u=ProjectUser.create(:project_id => @pr.id , :user_id => i)
                # p_u.project_id=@pr.id
                # p_u.user_id=i
                  if ! p_u
                      @pr.destroy

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]
---
  def destroy
     if(session[:user][0]['id'] == Project.find(params[:id]).manager_id)
     Project.destroy(params[:id])