app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "role", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "shahrukh"], ["email", "s@lo.com"], ["role", "Manager"], ["password", "hello"], ["created_at", "2018-03-13 13:20:44.817654"], ["updated_at", "2018-03-13 13:20:44.817654"]]
---
  def signup
  	 @user = User.new()
  	 @user.name=user_params[:name]
  	 @user.email=user_params[:email]
  	 @user.password=user_params[:password]
  	 @user.role=user_params[:role]



      if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2  [["email", "a@1.com"], ["password", "1234"]]
---
  def process_login
    @user = User.where(:email => user_params[:email] , :password => user_params[:password])